app/views/favorites/_favorite.html.erb

<div class="favorite-link" id="favorite-link-<%= book.id %>">
  <% if current_user.favorites.find_by(book_id: book.id) %>
    <%= link_to destroy_path(book.id), method: :delete, remote: true do %>
        <div class = "iine__button">❤️<%= book.favorites.count %></div>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

    <%= link_to create_path(book.id), method: :post, remote:true do %>
        <div class = "iine__button">♡️<%= book.favorites.count %></div>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]