app/views/users/show.html.erb

			<td><i class="fa fa-comment"></i>
						<a href="#comments"><%= "コメント数: #{book.book_comments.count}" %></a>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]