app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
						<i class="fa fa-comment"></i>
						<a href="#comments"><%= "コメント数: #{book.book_comments.count}" %></a>