app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
		<table class="table">
			<% @book.book_comments.each do |book_comment| %>