app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dddd"], ["body", "ssssss"], ["user_id", 4], ["created_at", "2020-06-06 03:55:03.865274"], ["updated_at", "2020-06-06 03:55:03.865274"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
    @user = current_user
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to book_path(@book.id), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def correct_user
    @book = current_user.books.find_by(id: params[:id])