app/controllers/favorites_controller.rb

  	def create
    	favorite = current_user.favorites.new(book_id: @book.id)
    	favorite.save
---
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 1], ["created_at", "2020-06-06 02:52:49.663690"], ["updated_at", "2020-06-06 02:52:49.663690"]]

  	def destroy
    	favorite = current_user.favorites.find_by(book_id: @book.id)
    	favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 7]]